let reg = new RegExp(/a7M/);

// . 表示各种打印或者非打印字符
(/a.c/)

// 实际匹配点需要加上反斜杠
/filename\.exe/

// 中括号表示列表(匹配其中的一项即可)
(/ chapter [12345]/)
// 连续的字符使用短线代替
(/ chapter [1-5]/)

^ 表示取反，不包括这些内容
(/ chapter [^1-5]/)

// 完成大写小写和数字的匹配
(/A-Za-z0-9/)

| 表示或
(/^(Chapter|Section)[1-9[0-9]{0,1}]$/)

/\b([a-z]+)\1\b/ig

/(\w+):\/\/([^/:]+)(:\d*)?([^#]*)/

/^(?:Chapter|Section)[1-9][0-9]{0,1}$/

/[-a-z]/

/Windows(?=95|98|NT)/

// 空行
/^\s*$/

// 匹配两位数字加五位数字加-的ID
/\d{2}-\d{5}/

// 匹配0531-12345678电话号码
/\d{4}-\d{8}/

/<\s*(\S+)(\s[^>]*)?>[\s\S]*<\s*\/\1\s*>/